heatExchanger/all_auto/case_10_20/constant/fins/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fins/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_fins
    {
        type            patch;
        nFaces          454;
        startFace       3687;
    }
    fins_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          56;
        startFace       4141;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_fins;
    }
    fins_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          960;
        startFace       4197;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_fins;
    }
)

// ************************************************************************* //
