heatExchanger/all_auto/case_10_20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          35;
        startFace       25045;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          26;
        startFace       25080;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1327;
        startFace       25106;
    }
    walls_heater
    {
        type            patch;
        nFaces          204;
        startFace       26433;
    }
    base_fins
    {
        type            patch;
        nFaces          454;
        startFace       26637;
    }
)

// ************************************************************************* //
